# encoding: utf-8

class Organization < String

	LIST = [
		"軌道千早",
		"イワサキ",
		"テラウェア",
		"ヘイロン",
		"ＣＦＣ",
		"セフィロト",
		"カーライル",
		"河渡連合",
		"三合会",
		"Ｎ◎ＶＡ軍",
		"Ｎ◎ＶＡ行政府",
		"バーグラーレコード",
		"日本軍",
		"ヒュプノス",
		"ブラックハウンド",
		"マリオネット",
		"氷の静謐",
		"フェスラー公国",
		"ヒラサカ",
		"ＢＩＯＳ",
		"トライアンフ",
		"ミカヅチ部隊",
		"羅生門",
		"岩崎御庭番集",
		"ナンバーズ",
		"マーダー・インク",
		"魔会",
		"ヤオヨロズ",
		"ルテチア",
		"和光技研",
		"キャノンボール",
		"関東驚愕連合",
		"ＬＩＭＩＴＳ",
		"真教浄化派",
		"真教浄化派",
		"真教浄化派",
		"真教浄化派",
		"フリーランス",
		"フリーランス",
		"フリーランス",
		"聖母殿退魔局",
		"聖母殿異端改修局",
		"汎元殿",
		"世界魔術協会",
		"中華最高陰陽議会",
		"黄泉千五百軍",
		"サロン・ドルファン",
		"メトレス",
		"千早重工後方処理課第13班",
		"ＩＣＡＲ",
		"Ｎ．Ｉ．Ｋ．",
		"Ｎ◎ＶＡスポ",
		"ＳＳＳ",
		"Ｔ．Ｆ．",
		"フリーランス",
		"天津一族",
		"稲垣機関",
		"ケルビム",
		"下水王国",
		"白き狼",
		"新星帝都大学",
		"ネヴァーランド",
		"ＡＣＥ",
		"ＭＩＤ",
		"音羽商事",
		"桜華道場",


	]

	def initialize
		self << LIST.sample
	end

	def change
		clear
		self << LIST.sample
	end
end

